Tekla.Structures.Model.Position.DepthEnum
The position in the depth sense.

Tekla.Structures.Model.Position.DepthEnum.MIDDLE
The middle option.

Tekla.Structures.Model.Position.DepthEnum.FRONT
The front option.

Tekla.Structures.Model.Position.DepthEnum.BEHIND
The behind option.